Revit 2024 API
WireSizeSetIterator Class
An iterator to a wire size set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class WireSizeSetIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class WireSizeSetIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class WireSizeSetIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.WireSizeSetIterator
See Also
WireSizeSetIterator Members
Autodesk.Revit.DB.Electrical Namespace